Tekla Open API Reference for Tekla Structures 2025
IEvents.DrawingReadyForIssuingChange Event
 The DrawingReadyForIssuingChange event is raised just after a drawing is marked or unmarked ready for issuing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
event Events.DrawingReadyForIssuingChangeDelegate DrawingReadyForIssuingChange
Event DrawingReadyForIssuingChange As Events.DrawingReadyForIssuingChangeDelegate
Value
Type: Tekla.Structures.Drawing.Events.DrawingReadyForIssuingChangeDelegate
See Also
Reference
IEvents Interface
Tekla.Structures.Drawing Namespace